Revit 2025 API
ElementId Constructor
Overload List
Name | Description
ElementId(BuiltInCategory) |  Create an ElementId handle with the given BuiltInCategory id.
ElementId(BuiltInParameter) |  Create an ElementId handle with the given BuiltInParameter id.
ElementId(Int32) | Obsolete.
 Create an ElementId handle with the given 32-bit integer id.
ElementId(Int64) |  Create an ElementId handle with the given 64-bit integer id.
Top
See Also
Reference
ElementId Class
Autodesk.Revit.DB Namespace